# TextNoteOptions Members (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
TextNoteOptions Members
TextNoteOptions Class Constructors Methods Properties See Also
---
The TextNoteOptions type exposes the following members.
# Constructors
| Name | Description |
| --- | --- |
| --- | --- | --- |
| TextNoteOptions()()()() | Default constructor; populates the options with their respective default values. |
| TextNoteOptions(ElementId) | Constructs text options to create text of the given type. |

# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Dispose | Releases all resources used by the TextNoteOptions |
| Equals | Determines whether the specified Object is equal to the current Object. (Inherited from Object.) |
| GetHashCode | Serves as a hash function for a particular type.  (Inherited from Object.) |
| GetType | Gets the Type of the current instance. (Inherited from Object.) |
| ToString | Returns a string that represents the current object. (Inherited from Object.) |

# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| HorizontalAlignment | Horizontal alignment of the text. |
| IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
| KeepRotatedTextReadable | Flag controling whether a rotate text is to stay oriented to be always readable. |
| Rotation | Base line angle of a text note, in radians. |
| TypeId | Id of a text type that defines the style of a text note. |
| VerticalAlignment | Vertical alignment of the text. |

# See Also
TextNoteOptions Class
Autodesk.Revit.DB Namespace